Core/src/Documents/УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ/УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ</name>
  <posting>Deny</posting>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеУведомленияОВвозеИзЕАЭСГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НомераКиЗ</name>
    <attributes>
      <name>НомерКиЗ</name>
      <type>
        <types>DefinedType.НомерКиЗГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>RFIDTID</name>
      <type>
        <types>DefinedType.RFIDTID</types>
      </type>
    </attributes>
    <attributes>
      <name>RFIDEPC</name>
      <type>
        <types>DefinedType.RFIDEPC</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/InformationRegisters/СтатусыИнформированияГИСМ/СтатусыИнформированияГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыИнформированияГИСМ</name>
  <resources>
    <name>ТекущееУведомление</name>
    <type>
      <types>DocumentRef.УведомлениеОбИмпортеМаркированныхТоваровГИСМ</types>
      <types>DocumentRef.УведомлениеОСписанииКиЗГИСМ</types>
      <types>DocumentRef.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыИнформированияГИСМ</types>
    </type>
  </resources>
  <resources>
    <name>ДальнейшееДействие</name>
    <type>
      <types>EnumRef.ДальнейшиеДействияПоВзаимодействиюГИСМ</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ДокументИнформированияГИСМ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/СтатусыИнформированияГИСМ/СтатусыИнформированияГИСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыИнформированияГИСМ</name>
  <enumValues>
    <name>Отсутствует</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>КПередаче</name>
  </enumValues>
  <enumValues>
    <name>КПередачеСписаниеКиЗ</name>
  </enumValues>
  <enumValues>
    <name>КПередачеМаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>КПередачеПеремаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>Передано</name>
  </enumValues>
  <enumValues>
    <name>ПереданоСписаниеКиЗ</name>
  </enumValues>
  <enumValues>
    <name>ПереданоМаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПереданоПеремаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоГИСМ</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоГИСМСписаниеКиЗ</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоГИСММаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоГИСМПеремаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПринятоГИСМ</name>
  </enumValues>
  <enumValues>
    <name>ПринятоГИСМСписаниеКиЗ</name>
  </enumValues>
  <enumValues>
    <name>ПринятоГИСММаркировкаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПринятоГИСМПеремаркировкаТоваров</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнтеграцияГИСМПереопределяемый.ОбработкаЗаполненияУведомленияОВвозеИзЕАЭСГИСМ(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоНовый() И ЗначениеЗаполнено(Основание) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	СтатусыИнформированияГИСМ.ТекущееУведомление
		|ИЗ
		|	РегистрСведений.СтатусыИнформированияГИСМ КАК СтатусыИнформированияГИСМ
		|ГДЕ
		|	СтатусыИнформированияГИСМ.Документ = &Основание
		|	И НЕ СтатусыИнформированияГИСМ.Статус В (
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияГИСМ.ОтклоненоГИСМ)
		|		)
		|	И НЕ СтатусыИнформированияГИСМ.ТекущееУведомление = ЗНАЧЕНИЕ(Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.ПустаяСсылка)
		|	И  СтатусыИнформированияГИСМ.ТекущееУведомление <> НЕОПРЕДЕЛЕНО ";
		
		Запрос.УстановитьПараметр("Основание", Основание);
		
		Результат = Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			ТекстОшибки = НСтр("ka='დოკუმენტ %1-ისთვის უკვე არსებობს მიმდინარე %2.';ru='Для документа %1 уже существует текущая %2.'");
				ТекстОшибки =  СтрШаблон(ТекстОшибки, Основание, Выборка.ТекущееУведомление);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстОшибки,
					ЭтотОбъект,
					,
					,
					Отказ);
			
				КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	НомераКиЗ.Очистить();
	Основание = Неопределено;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("ЗаписьНового", Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
